
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	//Сумма = Цена * количество  
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Цена * Элементы.Товары.ТекущиеДанные.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.Сумма = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
    
КонецПроцедуры

&НаСервере
Функция ПолучитьЦену(НоменклатураДокумента)
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Контрагент",Объект.Контрагент);
	СтруктураОтбора.Вставить("Договор",Объект.Договор);
	СтруктураОтбора.Вставить("Номенклатура",НоменклатураДокумента);
	
	РезультатОтбора = РегистрыСведений.ЦеныПоставщиков.Получить(СтруктураОтбора);
		
	Возврат РезультатОтбора.Цена;
КонецФункции 

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	СтрокаРасчета.Цена = ПолучитьЦену(СтрокаРасчета.Номенклатура);
	ТоварыЦенаПриИзменении(Элемент);
КонецПроцедуры
