
&НаКлиенте
Процедура Расш2_Расш2_СогласоватьПосле(Команда)
	
	Если Объект.Расш2_ТребуетсяСогласованиеЦены = Истина И Объект.Расш2_Согласована = Ложь Тогда
		
		Если Объект.Проведен Тогда
			ПоказатьПредупреждение(, "Нельзя согласовать цену в проведённом документе!");
			Возврат;
		КонецЕсли;
		
		// Меняем реквизит прямо в объекте формы
		Объект.Расш2_Согласована = Истина;
		
		// Сохраняем через форму (без параметров — стандартный вызов)
		Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш2_ОтклонитьПосле(Команда)
	
	Если Объект.Расш2_ТребуетсяСогласованиеЦены = Истина И Объект.Расш2_Согласована = Ложь Тогда
		
		Если Объект.Проведен Тогда
			ПоказатьПредупреждение(, "Нельзя отклонить цену в проведённом документе!");
			Возврат;
		КонецЕсли;
		
		ПоказатьВводСтроки(
			Новый ОписаниеОповещения("Расш2_ОтклонитьВводСтрокиЗавершение", ЭтотОбъект),
		"Укажите причину отклонения");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Расш2_ОтклонитьВводСтрокиЗавершение(Комментарий, Параметры) Экспорт
	
	Если Комментарий = Неопределено ИЛИ ПустаяСтрока(Комментарий) Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Расш2_Согласована = Ложь;
	Объект.Расш2_КомментарийСогласования = Комментарий;
	
	// Сохраняем через форму
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Расш2_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Объект.Расш2_ТребуетсяСогласованиеЦены = Ложь;	 
	Для каждого СтрокаТовара Из Объект.Товары Цикл
	
		// Базовая сумма без скидок
        БазоваяСумма = СтрокаТовара.Цена * СтрокаТовара.КоличествоУпаковок;
        
        Если БазоваяСумма > 0 Тогда
            // Итоговая сумма уже со всеми скидками
            ИтоговаяСумма = СтрокаТовара.Сумма;
            СуммаСкидки = БазоваяСумма - ИтоговаяСумма;
            ПроцентСкидки = СуммаСкидки / БазоваяСумма * 100;
            
            Если ПроцентСкидки > 10 Тогда
                Объект.Расш2_ТребуетсяСогласованиеЦены = Истина;
                Прервать;
            КонецЕсли;
        КонецЕсли;	
	
	КонецЦикла;
КонецПроцедуры
