
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	//единичный подбор
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", , Элементы.Материалы);
	
	//множественный подбор
	//ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Материалы);
	
	//множественный выбор
	//ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора"
	//				, ПараметрыФормы, Элементы.Материалы);   
	
	//множеств подбор с множеств выбором
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Материалы);
					
КонецПроцедуры

&НаКлиенте
Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	//для одного и множеств подбора
	//Элементы.Материалы.ДобавитьСтроку();
	//Элементы.Материалы.ТекущиеДанные.Материал = ВыбранноеЗначение;    
	
	//для множеств выбора
	Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		НоваяСтрока = Объект.Материалы.Добавить();
		НоваяСтрока.Материал = ВыбранныйЭлемент;
	КонецЦикла;
	
КонецПроцедуры        

&НаКлиенте
Асинх Процедура ПодборВопрос(Команда)
	Результат = Ждать ВопросАсинх("Подобрать номенклатуру в документ?"
				, РежимДиалогаВопрос.ДаНет);
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
		ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора"
				, ПараметрыФормы, Элементы.Материалы);
	КонецЕсли;
КонецПроцедуры
