
&НаКлиенте
Процедура СпособОплатыПриИзменении(Элемент)
	Элементы.ГруппаПлатежа.Видимость = НоваяВидимость(Объект.СпособОплаты);
КонецПроцедуры        

&НаСервере
Функция НоваяВидимость(Способ)          
	
	Если Способ = Перечисления.СпособОплаты.Безналичные Тогда
		РезультатФункции = Истина;
	Иначе 
		РезультатФункции = Ложь;
	КонецЕсли;
	Возврат РезультатФункции;  
	
КонецФункции 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ГруппаПлатежа.Видимость = НоваяВидимость(Объект.СпособОплаты);
КонецПроцедуры


