
&НаКлиенте
Процедура ВычислитьВыражение(Команда)
	Объект.Результат = Вычислить(Объект.Алгоритм);
	Элементы.Группа1.Заголовок = "Тип значения: "+ТипЗнч(Объект.Результат);
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьЗначениеВТексте(Команда)
	 Если ТипЗнч(Объект.Результат) = Тип("Число") Тогда
	     Объект.Алгоритм = ""+Объект.Результат;
		 Объект.Алгоритм = СтрЗаменить(Объект.Алгоритм,Символы.НПП,"");
		 Объект.Алгоритм = СтрЗаменить(Объект.Алгоритм,",",".");
	 ИначеЕсли ТипЗнч(Объект.Результат) = Тип("Строка") Тогда
		 ЧислоСтрок = СтрЧислоСтрок(Объект.Результат);
		 Если ЧислоСтрок = 1 Тогда 
		     Объект.Алгоритм = """"+СтрЗаменить(Объект.Результат,"""","""""")+"""";
		 Иначе 
			  Объект.Алгоритм = """";
			 Для НомерСтроки=1 По ЧислоСтрок Цикл
				 ТекстСтроки = СтрЗаменить(СтрПолучитьСтроку(Объект.Результат, НомерСтроки),"""",""""""); 
				 Если Объект.Алгоритм = """" Тогда
				 	Объект.Алгоритм = Объект.Алгоритм+ТекстСтроки;
				 Иначе
				 	Объект.Алгоритм = Объект.Алгоритм+Символы.ПС+"|"+ТекстСтроки;
				 КонецЕсли;
			 КонецЦикла;
			  Объект.Алгоритм = Объект.Алгоритм+"""";
			 
		 КонецЕсли;	 
	 ИначеЕсли ТипЗнч(Объект.Результат) = Тип("Дата") Тогда
		 Если ЗначениеЗаполнено(Объект.Результат) Тогда
		 	Объект.Алгоритм = "'"+Формат(Объект.Результат,"ДФ=yyyyMMdd")+?(Час(Объект.Результат)<10,"0","")+Формат(Объект.Результат,"ДЛФ=T")+"'";
		 Иначе
		 	Объект.Алгоритм = "'00010101000000'"
		 КонецЕсли;
		 
	 ИначеЕсли ТипЗнч(Объект.Результат) = Тип("Булево") Тогда
	     Объект.Алгоритм = Формат(Объект.Результат, "БЛ=Ложь; БИ=Истина");
		 
	 ИначеЕсли ТипЗнч(Объект.Результат) = Тип("Неопределено") Тогда
		 Объект.Алгоритм = "Неопределено";
			 
	 КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	Элементы.Группа1.Заголовок = "Тип значения: "+ТипЗнч(Объект.Результат);
КонецПроцедуры

