
&НаКлиенте
Процедура РасчетСуммы()
	 СтрокаРасчета = Элементы.Товары.ТекущиеДанные;
	 ЗначениеСкидки = ПолучитьЗначениеСкидки(СтрокаРасчета.Скидка);
	 
	 СтрокаРасчета.Сумма = СтрокаРасчета.Количество * СтрокаРасчета.Цена;
	 СтрокаРасчета.СуммаСкидки = СтрокаРасчета.Сумма * ЗначениеСкидки / 100;
	 СтрокаРасчета.Всего = СтрокаРасчета.Сумма - СтрокаРасчета.СуммаСкидки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСкидки(ссылка)  
	
Возврат Ссылка.ПроцентСкидки;

КонецФункции 

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	РасчетСуммы();		
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	РасчетСуммы();
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	РасчетСуммы();
КонецПроцедуры


